RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_Wakeup
****************************************************************************//**
*
* Resumes the middleware after System Deep Sleep.
*
* This function is used to resume the middleware operation after exiting
* System Deep Sleep. After the CAPSENSE&trade; HW block is powered off,
* an extra delay is required to establish the correct operation of
* the CAPSENSE&trade; HW block.
*
* This function is called by the Cy_CapSense_DeepSleepCallback() function after
* exiting System Deep Sleep if the CAPSENSE&trade; Deep Sleep callback is registered.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_Wakeup(const cy_stc_capsense_context_t * context)
{
    Cy_SysLib_DelayUs((uint16_t)context->ptrCommonConfig->analogWakeupDelay);
}


/*******************************************************************************
* Function Name: Cy_CapSense_DeepSleepCallback
****************************************************************************//**
*
* Handles CPU active to System Deep Sleep power mode transition for the CAPSENSE&trade;
* middleware.
*
* Calling this function directly from the application program is not recommended.
* Instead, Cy_SysPm_CpuEnterDeepSleep() should be used for the CPU active to System Deep Sleep
* power mode transition of the device.
* \note
* After the CPU Deep Sleep transition, the device automatically goes
* to System Deep Sleep if all conditions are fulfilled: another core is
* in CPU Deep Sleep, all the peripherals are ready to System Deep Sleep, etc.
* (see details in the device TRM).
*
* For proper operation of the CAPSENSE&trade; middleware during the CPU active to
* System Deep Sleep mode transition, a callback to this function should be registered
* using the Cy_SysPm_RegisterCallback() function with CY_SYSPM_DEEPSLEEP
* type. After the callback is registered, this function is called by the
* Cy_SysPm_CpuEnterDeepSleep() function to prepare the middleware to the device
* power mode transition.
*
* When this function is called with CY_SYSPM_CHECK_READY as an input, this
* function returns CY_SYSPM_SUCCESS if no scanning is in progress or not
* a single HW block is captured by the CAPSENSE&trade; middleware. Otherwise
* CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
* cannot change the power mode without completing the current scan as
* a transition to System Deep Sleep during the scan can disrupt the middleware
* operation.
*
* When this function is called with CY_SYSPM_AFTER_TRANSITION as an input, then
* the Cy_CapSense_Wakeup() function is called to resume the middleware
* operation after exiting System Deep Sleep. If there are no CAPSENSE&trade; captured
* HW blocks the Cy_CapSense_Wakeup() function calling is omitted and restoring
* CAPSENSE&trade; immediately after Deep Sleep without the wake-up delay can lead to
* unpredictable behavior.
*
* For details of SysPm types and macros refer to the SysPm section of the
* PDL documentation.
*
* \param callbackParams
* Refer to the description of the cy_stc_syspm_callback_params_t type in the
* Peripheral Driver Library documentation.
*
* \param mode
* Specifies mode cy_en_syspm_callback_mode_t.
*
* \return
* Returns the status cy_en_syspm_status_t of the operation requested
* by the mode parameter:
* - CY_SYSPM_SUCCESS  - System Deep Sleep power mode can be entered.
* - CY_SYSPM_FAIL     - System Deep Sleep power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_CapSense_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams,
                cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    const cy_stc_capsense_context_t * capsenseCxt = (cy_stc_capsense_context_t *)callbackParams->context;

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        cy_en_csd_key_t mwKey;

        switch(mode)
        {
            case CY_SYSPM_CHECK_READY:
                mwKey = Cy_CSD_GetLockStatus(capsenseCxt->ptrCommonConfig->ptrCsdBase, capsenseCxt->ptrCommonConfig->ptrCsdContext);

                if (CY_CSD_CAPSENSE_KEY == mwKey)
                {
                    if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(capsenseCxt))
                    {
                        retVal = CY_SYSPM_FAIL;
                    }
                }
                break;

            case CY_SYSPM_AFTER_TRANSITION:
                mwKey = Cy_CSD_GetLockStatus(capsenseCxt->ptrCommonConfig->ptrCsdBase, capsenseCxt->ptrCommonConfig->ptrCsdContext);

                if (CY_CSD_CAPSENSE_KEY == mwKey)
                {
                    Cy_CapSense_Wakeup(capsenseCxt);
                }
                break;

            default:
                /* No action for other modes */
                break;
        }
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
        uint32_t curChIndex;
        const cy_stc_msc_channel_config_t * ptrMscChCfg = &capsenseCxt->ptrCommonConfig->ptrMscChConfig[0u];

        switch(mode)
        {
            case CY_SYSPM_CHECK_READY:
                if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(capsenseCxt))
                {
                    retVal = CY_SYSPM_FAIL;
                }
                break;

            case CY_SYSPM_AFTER_TRANSITION:
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    if (CY_MSC_CAPSENSE_KEY == Cy_MSC_GetLockStatus(ptrMscChCfg->ptrMscBase,
                                                                    ptrMscChCfg->ptrMscContext))
                    {
                        Cy_CapSense_Wakeup(capsenseCxt);
                        break;
                    }
                    ptrMscChCfg++;
                }
                break;

            default:
                /* No action for other modes */
                break;
        }
    #endif

